test/wrk2_fission/c_fanout/result/baseline_13.log
Running 1m test @ http://130.127.133.59:31424
  1 threads and 1 connections
  Thread calibration: mean lat.: 5026.903ms, rate sampling interval: 17940ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    34.82s    14.48s    1.00m    57.59%
    Req/Sec    10.00      0.00    10.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   34.83s 
 75.000%   47.42s 
 90.000%    0.91m 
 99.000%    0.99m 
 99.900%    1.00m 
 99.990%    1.00m 
 99.999%    1.00m 
100.000%    1.00m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

   10043.391     0.000000            1         1.00
   14794.751     0.100000           51         1.11
   19759.103     0.200000          102         1.25
   24756.223     0.300000          153         1.43
   29736.959     0.400000          203         1.67
   34832.383     0.500000          254         2.00
   37224.447     0.550000          279         2.22
   39780.351     0.600000          305         2.50
   42205.183     0.650000          330         2.86
   44990.463     0.700000          355         3.33
   47513.599     0.750000          381         4.00
   48660.479     0.775000          393         4.44
   49938.431     0.800000          406         5.00
   51249.151     0.825000          419         5.71
   52396.031     0.850000          431         6.67
   53706.751     0.875000          444         8.00
   54296.575     0.887500          450         8.89
   54984.703     0.900000          457        10.00
   55574.527     0.912500          463        11.43
   56131.583     0.925000          469        13.33
   56819.711     0.937500          476        16.00
   57147.391     0.943750          479        17.78
   57442.303     0.950000          482        20.00
   57769.983     0.956250          485        22.86
   58064.895     0.962500          488        26.67
   58425.343     0.968750          492        32.00
   58523.647     0.971875          493        35.56
   58720.255     0.975000          495        40.00
   58818.559     0.978125          496        45.71
   59015.167     0.981250          498        53.33
   59244.543     0.984375          500        64.00
   59244.543     0.985938          500        71.11
   59342.847     0.987500          501        80.00
   59441.151     0.989062          502        91.43
   59539.455     0.990625          503       106.67
   59637.759     0.992188          504       128.00
   59637.759     0.992969          504       142.22
   59637.759     0.993750          504       160.00
   59736.063     0.994531          505       182.86
   59736.063     0.995313          505       213.33
   59834.367     0.996094          506       256.00
   59834.367     0.996484          506       284.44
   59834.367     0.996875          506       320.00
   59834.367     0.997266          506       365.71
   59834.367     0.997656          506       426.67
   59965.439     0.998047          507       512.00
   59965.439     1.000000          507          inf
#[Mean    =    34821.663, StdDeviation   =    14482.615]
#[Max     =    59932.672, Total count    =          507]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------

  Latency Distribution (HdrHistogram - Uncorrected Latency (measured without taking delayed starts into account))
 50.000%   96.83ms
 75.000%  102.53ms
 90.000%  107.46ms
 99.000%  123.07ms
 99.900%  131.97ms
 99.990%  390.65ms
 99.999%  390.65ms
100.000%  390.65ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      79.231     0.000000            1         1.00
      87.551     0.100000           51         1.11
      90.815     0.200000          103         1.25
      93.375     0.300000          154         1.43
      95.615     0.400000          206         1.67
      96.831     0.500000          254         2.00
      97.663     0.550000          280         2.22
      98.815     0.600000          305         2.50
      99.647     0.650000          330         2.86
     101.183     0.700000          356         3.33
     102.591     0.750000          381         4.00
     103.167     0.775000          393         4.44
     103.807     0.800000          406         5.00
     104.639     0.825000          419         5.71
     105.599     0.850000          431         6.67
     106.751     0.875000          444         8.00
     107.007     0.887500          450         8.89
     107.583     0.900000          457        10.00
     108.095     0.912500          463        11.43
     108.991     0.925000          469        13.33
     110.143     0.937500          476        16.00
     110.591     0.943750          479        17.78
     111.871     0.950000          482        20.00
     113.023     0.956250          485        22.86
     113.407     0.962500          488        26.67
     115.711     0.968750          492        32.00
     116.479     0.971875          493        35.56
     117.439     0.975000          495        40.00
     117.695     0.978125          496        45.71
     118.719     0.981250          498        53.33
     119.231     0.984375          500        64.00
     119.231     0.985938          500        71.11
     121.151     0.987500          501        80.00
     123.071     0.989062          502        91.43
     125.119     0.990625          503       106.67
     127.935     0.992188          504       128.00
     127.935     0.992969          504       142.22
     127.935     0.993750          504       160.00
     128.703     0.994531          505       182.86
     128.703     0.995313          505       213.33
     131.967     0.996094          506       256.00
     131.967     0.996484          506       284.44
     131.967     0.996875          506       320.00
     131.967     0.997266          506       365.71
     131.967     0.997656          506       426.67
     390.655     0.998047          507       512.00
     390.655     1.000000          507          inf
#[Mean    =       98.163, StdDeviation   =       15.333]
#[Max     =      390.400, Total count    =          507]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  610 requests in 1.00m, 368.74KB read
Requests/sec:     10.17
Transfer/sec:      6.14KB