test/wrk2_fission/c_fanout/result/orig_5.log
Running 1m test @ http://130.127.133.59:31424
  1 threads and 1 connections
  Thread calibration: mean lat.: 4976.692ms, rate sampling interval: 17989ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    35.43s    14.30s    1.00m    57.93%
    Req/Sec    15.50      0.50    16.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   35.59s 
 75.000%   47.81s 
 90.000%    0.92m 
 99.000%    0.99m 
 99.900%    1.00m 
 99.990%    1.00m 
 99.999%    1.00m 
100.000%    1.00m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

   10035.199     0.000000            1         1.00
   15671.295     0.100000           80         1.11
   20594.687     0.200000          159         1.25
   25608.191     0.300000          239         1.43
   30654.463     0.400000          318         1.67
   35586.047     0.500000          397         2.00
   38076.415     0.550000          437         2.22
   40468.479     0.600000          477         2.50
   42926.079     0.650000          517         2.86
   45318.143     0.700000          556         3.33
   47808.511     0.750000          596         4.00
   49053.695     0.775000          616         4.44
   50266.111     0.800000          636         5.00
   51478.527     0.825000          656         5.71
   52625.407     0.850000          675         6.67
   53936.127     0.875000          695         8.00
   54558.719     0.887500          705         8.89
   55148.543     0.900000          715        10.00
   55771.135     0.912500          725        11.43
   56393.727     0.925000          735        13.33
   56983.551     0.937500          745        16.00
   57311.231     0.943750          750        17.78
   57606.143     0.950000          755        20.00
   57901.055     0.956250          760        22.86
   58228.735     0.962500          765        26.67
   58523.647     0.968750          770        32.00
   58654.719     0.971875          772        35.56
   58851.327     0.975000          775        40.00
   58949.631     0.978125          777        45.71
   59146.239     0.981250          780        53.33
   59277.311     0.984375          782        64.00
   59342.847     0.985938          783        71.11
   59441.151     0.987500          785        80.00
   59506.687     0.989062          786        91.43
   59572.223     0.990625          787       106.67
   59637.759     0.992188          788       128.00
   59703.295     0.992969          789       142.22
   59736.063     0.993750          790       160.00
   59736.063     0.994531          790       182.86
   59801.599     0.995313          791       213.33
   59801.599     0.996094          791       256.00
   59867.135     0.996484          792       284.44
   59867.135     0.996875          792       320.00
   59867.135     0.997266          792       365.71
   59932.671     0.997656          793       426.67
   59932.671     0.998047          793       512.00
   59932.671     0.998242          793       568.89
   59932.671     0.998437          793       640.00
   59932.671     0.998633          793       731.43
   59998.207     0.998828          794       853.33
   59998.207     1.000000          794          inf
#[Mean    =    35429.136, StdDeviation   =    14302.127]
#[Max     =    59965.440, Total count    =          794]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------

  Latency Distribution (HdrHistogram - Uncorrected Latency (measured without taking delayed starts into account))
 50.000%   60.29ms
 75.000%   62.97ms
 90.000%   68.16ms
 99.000%   96.13ms
 99.900%  121.98ms
 99.990%  122.56ms
 99.999%  122.56ms
100.000%  122.56ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      57.087     0.000000            1         1.00
      58.399     0.100000           87         1.11
      58.815     0.200000          162         1.25
      59.359     0.300000          243         1.43
      59.871     0.400000          326         1.67
      60.287     0.500000          397         2.00
      60.639     0.550000          440         2.22
      60.927     0.600000          477         2.50
      61.439     0.650000          519         2.86
      61.983     0.700000          557         3.33
      62.975     0.750000          598         4.00
      63.615     0.775000          616         4.44
      64.351     0.800000          636         5.00
      65.407     0.825000          656         5.71
      66.687     0.850000          675         6.67
      67.455     0.875000          695         8.00
      67.839     0.887500          705         8.89
      68.159     0.900000          715        10.00
      68.671     0.912500          725        11.43
      69.119     0.925000          735        13.33
      70.527     0.937500          746        16.00
      70.911     0.943750          750        17.78
      73.471     0.950000          755        20.00
      74.367     0.956250          760        22.86
      78.335     0.962500          765        26.67
      80.383     0.968750          770        32.00
      81.727     0.971875          772        35.56
      86.527     0.975000          775        40.00
      89.407     0.978125          777        45.71
      92.991     0.981250          780        53.33
      94.015     0.984375          782        64.00
      94.271     0.985938          783        71.11
      95.423     0.987500          785        80.00
      96.127     0.989062          786        91.43
      96.383     0.990625          787       106.67
      97.471     0.992188          788       128.00
      97.919     0.992969          789       142.22
      99.327     0.993750          790       160.00
      99.327     0.994531          790       182.86
     101.503     0.995313          791       213.33
     101.503     0.996094          791       256.00
     114.879     0.996484          792       284.44
     114.879     0.996875          792       320.00
     114.879     0.997266          792       365.71
     121.983     0.997656          793       426.67
     121.983     0.998047          793       512.00
     121.983     0.998242          793       568.89
     121.983     0.998437          793       640.00
     121.983     0.998633          793       731.43
     122.559     0.998828          794       853.33
     122.559     1.000000          794          inf
#[Mean    =       62.542, StdDeviation   =        7.147]
#[Max     =      122.496, Total count    =          794]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  935 requests in 1.00m, 294.93KB read
Requests/sec:     15.58
Transfer/sec:      4.91KB